{
    "architectures": [
        "Qwen3_5MoeForConditionalGeneration"
    ],
    "image_token_id": 248056,
    "model_type": "qwen3_5_moe",
    "text_config": {
        "attention_bias": false,
        "attention_dropout": 0.0,
        "attn_output_gate": true,
        "dtype": "bfloat16",
        "eos_token_id": 248044,
        "full_attention_interval": 4,
        "head_dim": 256,
        "hidden_act": "silu",
        "hidden_size": 3072,
        "initializer_range": 0.02,
        "layer_types": [
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention",
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention",
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention",
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention",
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention",
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention",
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention",
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention",
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention",
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention",
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention",
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention"
        ],
        "linear_conv_kernel_dim": 4,
        "linear_key_head_dim": 128,
        "linear_num_key_heads": 16,
        "linear_num_value_heads": 64,
        "linear_value_head_dim": 128,
        "max_position_embeddings": 262144,
        "mlp_only_layers": [],
        "model_type": "qwen3_5_moe_text",
        "moe_intermediate_size": 1024,
        "mtp_num_hidden_layers": 1,
        "mtp_use_dedicated_embeddings": false,
        "num_attention_heads": 32,
        "num_experts": 256,
        "num_experts_per_tok": 8,
        "num_hidden_layers": 48,
        "num_key_value_heads": 2,
        "rms_norm_eps": 1e-06,
        "router_aux_loss_coef": 0.001,
        "shared_expert_intermediate_size": 1024,
        "use_cache": true,
        "vocab_size": 248320,
        "mamba_ssm_dtype": "float32",
        "rope_parameters": {
            "mrope_interleaved": true,
            "mrope_section": [
                11,
                11,
                10
            ],
            "rope_type": "default",
            "rope_theta": 10000000,
            "partial_rotary_factor": 0.25
        }
    },
    "tie_word_embeddings": false,
    "transformers_version": "4.57.0.dev0",
    "video_token_id": 248057,
    "vision_config": {
        "deepstack_visual_indexes": [],
        "depth": 27,
        "hidden_act": "gelu_pytorch_tanh",
        "hidden_size": 1152,
        "in_channels": 3,
        "initializer_range": 0.02,
        "intermediate_size": 4304,
        "model_type": "qwen3_5_moe",
        "num_heads": 16,
        "num_position_embeddings": 2304,
        "out_hidden_size": 3072,
        "patch_size": 16,
        "spatial_merge_size": 2,
        "temporal_patch_size": 2
    },
    "vision_end_token_id": 248054,
    "vision_start_token_id": 248053,
    "quantization_config": {
        "quant_method": "fp8",
        "activation_scheme": "dynamic",
        "weight_per_tensor": false,
        "act_per_tensor": false,
        "weight_block_size": [
            128,
            128
        ],
        "modules_to_not_convert": [
            "lm_head",
            "model.language_model.embed_tokens",
            "model.language_model.layers.0.linear_attn.conv1d",
            "model.language_model.layers.0.linear_attn.in_proj_a",
            "model.language_model.layers.0.linear_attn.in_proj_b",
            "model.language_model.layers.0.mlp.gate",
            "model.language_model.layers.0.mlp.shared_expert_gate",
            "model.language_model.layers.1.linear_attn.conv1d",
            "model.language_model.layers.1.linear_attn.in_proj_a",
            "model.language_model.layers.1.linear_attn.in_proj_b",
            "model.language_model.layers.1.mlp.gate",
            "model.language_model.layers.1.mlp.shared_expert_gate",
            "model.language_model.layers.10.linear_attn.conv1d",
            "model.language_model.layers.10.linear_attn.in_proj_a",
            "model.language_model.layers.10.linear_attn.in_proj_b",
            "model.language_model.layers.10.mlp.gate",
            "model.language_model.layers.10.mlp.shared_expert_gate",
            "model.language_model.layers.11.mlp.gate",
            "model.language_model.layers.11.mlp.shared_expert_gate",
            "model.language_model.layers.12.linear_attn.conv1d",
            "model.language_model.layers.12.linear_attn.in_proj_a",
            "model.language_model.layers.12.linear_attn.in_proj_b",
            "model.language_model.layers.12.mlp.gate",
            "model.language_model.layers.12.mlp.shared_expert_gate",
            "model.language_model.layers.13.linear_attn.conv1d",
            "model.language_model.layers.13.linear_attn.in_proj_a",
            "model.language_model.layers.13.linear_attn.in_proj_b",
            "model.language_model.layers.13.mlp.gate",
            "model.language_model.layers.13.mlp.shared_expert_gate",
            "model.language_model.layers.14.linear_attn.conv1d",
            "model.language_model.layers.14.linear_attn.in_proj_a",
            "model.language_model.layers.14.linear_attn.in_proj_b",
            "model.language_model.layers.14.mlp.gate",
            "model.language_model.layers.14.mlp.shared_expert_gate",
            "model.language_model.layers.15.mlp.gate",
            "model.language_model.layers.15.mlp.shared_expert_gate",
            "model.language_model.layers.16.linear_attn.conv1d",
            "model.language_model.layers.16.linear_attn.in_proj_a",
            "model.language_model.layers.16.linear_attn.in_proj_b",
            "model.language_model.layers.16.mlp.gate",
            "model.language_model.layers.16.mlp.shared_expert_gate",
            "model.language_model.layers.17.linear_attn.conv1d",
            "model.language_model.layers.17.linear_attn.in_proj_a",
            "model.language_model.layers.17.linear_attn.in_proj_b",
            "model.language_model.layers.17.mlp.gate",
            "model.language_model.layers.17.mlp.shared_expert_gate",
            "model.language_model.layers.18.linear_attn.conv1d",
            "model.language_model.layers.18.linear_attn.in_proj_a",
            "model.language_model.layers.18.linear_attn.in_proj_b",
            "model.language_model.layers.18.mlp.gate",
            "model.language_model.layers.18.mlp.shared_expert_gate",
            "model.language_model.layers.19.mlp.gate",
            "model.language_model.layers.19.mlp.shared_expert_gate",
            "model.language_model.layers.2.linear_attn.conv1d",
            "model.language_model.layers.2.linear_attn.in_proj_a",
            "model.language_model.layers.2.linear_attn.in_proj_b",
            "model.language_model.layers.2.mlp.gate",
            "model.language_model.layers.2.mlp.shared_expert_gate",
            "model.language_model.layers.20.linear_attn.conv1d",
            "model.language_model.layers.20.linear_attn.in_proj_a",
            "model.language_model.layers.20.linear_attn.in_proj_b",
            "model.language_model.layers.20.mlp.gate",
            "model.language_model.layers.20.mlp.shared_expert_gate",
            "model.language_model.layers.21.linear_attn.conv1d",
            "model.language_model.layers.21.linear_attn.in_proj_a",
            "model.language_model.layers.21.linear_attn.in_proj_b",
            "model.language_model.layers.21.mlp.gate",
            "model.language_model.layers.21.mlp.shared_expert_gate",
            "model.language_model.layers.22.linear_attn.conv1d",
            "model.language_model.layers.22.linear_attn.in_proj_a",
            "model.language_model.layers.22.linear_attn.in_proj_b",
            "model.language_model.layers.22.mlp.gate",
            "model.language_model.layers.22.mlp.shared_expert_gate",
            "model.language_model.layers.23.mlp.gate",
            "model.language_model.layers.23.mlp.shared_expert_gate",
            "model.language_model.layers.24.linear_attn.conv1d",
            "model.language_model.layers.24.linear_attn.in_proj_a",
            "model.language_model.layers.24.linear_attn.in_proj_b",
            "model.language_model.layers.24.mlp.gate",
            "model.language_model.layers.24.mlp.shared_expert_gate",
            "model.language_model.layers.25.linear_attn.conv1d",
            "model.language_model.layers.25.linear_attn.in_proj_a",
            "model.language_model.layers.25.linear_attn.in_proj_b",
            "model.language_model.layers.25.mlp.gate",
            "model.language_model.layers.25.mlp.shared_expert_gate",
            "model.language_model.layers.26.linear_attn.conv1d",
            "model.language_model.layers.26.linear_attn.in_proj_a",
            "model.language_model.layers.26.linear_attn.in_proj_b",
            "model.language_model.layers.26.mlp.gate",
            "model.language_model.layers.26.mlp.shared_expert_gate",
            "model.language_model.layers.27.mlp.gate",
            "model.language_model.layers.27.mlp.shared_expert_gate",
            "model.language_model.layers.28.linear_attn.conv1d",
            "model.language_model.layers.28.linear_attn.in_proj_a",
            "model.language_model.layers.28.linear_attn.in_proj_b",
            "model.language_model.layers.28.mlp.gate",
            "model.language_model.layers.28.mlp.shared_expert_gate",
            "model.language_model.layers.29.linear_attn.conv1d",
            "model.language_model.layers.29.linear_attn.in_proj_a",
            "model.language_model.layers.29.linear_attn.in_proj_b",
            "model.language_model.layers.29.mlp.gate",
            "model.language_model.layers.29.mlp.shared_expert_gate",
            "model.language_model.layers.3.mlp.gate",
            "model.language_model.layers.3.mlp.shared_expert_gate",
            "model.language_model.layers.30.linear_attn.conv1d",
            "model.language_model.layers.30.linear_attn.in_proj_a",
            "model.language_model.layers.30.linear_attn.in_proj_b",
            "model.language_model.layers.30.mlp.gate",
            "model.language_model.layers.30.mlp.shared_expert_gate",
            "model.language_model.layers.31.mlp.gate",
            "model.language_model.layers.31.mlp.shared_expert_gate",
            "model.language_model.layers.32.linear_attn.conv1d",
            "model.language_model.layers.32.linear_attn.in_proj_a",
            "model.language_model.layers.32.linear_attn.in_proj_b",
            "model.language_model.layers.32.mlp.gate",
            "model.language_model.layers.32.mlp.shared_expert_gate",
            "model.language_model.layers.33.linear_attn.conv1d",
            "model.language_model.layers.33.linear_attn.in_proj_a",
            "model.language_model.layers.33.linear_attn.in_proj_b",
            "model.language_model.layers.33.mlp.gate",
            "model.language_model.layers.33.mlp.shared_expert_gate",
            "model.language_model.layers.34.linear_attn.conv1d",
            "model.language_model.layers.34.linear_attn.in_proj_a",
            "model.language_model.layers.34.linear_attn.in_proj_b",
            "model.language_model.layers.34.mlp.gate",
            "model.language_model.layers.34.mlp.shared_expert_gate",
            "model.language_model.layers.35.mlp.gate",
            "model.language_model.layers.35.mlp.shared_expert_gate",
            "model.language_model.layers.36.linear_attn.conv1d",
            "model.language_model.layers.36.linear_attn.in_proj_a",
            "model.language_model.layers.36.linear_attn.in_proj_b",
            "model.language_model.layers.36.mlp.gate",
            "model.language_model.layers.36.mlp.shared_expert_gate",
            "model.language_model.layers.37.linear_attn.conv1d",
            "model.language_model.layers.37.linear_attn.in_proj_a",
            "model.language_model.layers.37.linear_attn.in_proj_b",
            "model.language_model.layers.37.mlp.gate",
            "model.language_model.layers.37.mlp.shared_expert_gate",
            "model.language_model.layers.38.linear_attn.conv1d",
            "model.language_model.layers.38.linear_attn.in_proj_a",
            "model.language_model.layers.38.linear_attn.in_proj_b",
            "model.language_model.layers.38.mlp.gate",
            "model.language_model.layers.38.mlp.shared_expert_gate",
            "model.language_model.layers.39.mlp.gate",
            "model.language_model.layers.39.mlp.shared_expert_gate",
            "model.language_model.layers.4.linear_attn.conv1d",
            "model.language_model.layers.4.linear_attn.in_proj_a",
            "model.language_model.layers.4.linear_attn.in_proj_b",
            "model.language_model.layers.4.mlp.gate",
            "model.language_model.layers.4.mlp.shared_expert_gate",
            "model.language_model.layers.40.linear_attn.conv1d",
            "model.language_model.layers.40.linear_attn.in_proj_a",
            "model.language_model.layers.40.linear_attn.in_proj_b",
            "model.language_model.layers.40.mlp.gate",
            "model.language_model.layers.40.mlp.shared_expert_gate",
            "model.language_model.layers.41.linear_attn.conv1d",
            "model.language_model.layers.41.linear_attn.in_proj_a",
            "model.language_model.layers.41.linear_attn.in_proj_b",
            "model.language_model.layers.41.mlp.gate",
            "model.language_model.layers.41.mlp.shared_expert_gate",
            "model.language_model.layers.42.linear_attn.conv1d",
            "model.language_model.layers.42.linear_attn.in_proj_a",
            "model.language_model.layers.42.linear_attn.in_proj_b",
            "model.language_model.layers.42.mlp.gate",
            "model.language_model.layers.42.mlp.shared_expert_gate",
            "model.language_model.layers.43.mlp.gate",
            "model.language_model.layers.43.mlp.shared_expert_gate",
            "model.language_model.layers.44.linear_attn.conv1d",
            "model.language_model.layers.44.linear_attn.in_proj_a",
            "model.language_model.layers.44.linear_attn.in_proj_b",
            "model.language_model.layers.44.mlp.gate",
            "model.language_model.layers.44.mlp.shared_expert_gate",
            "model.language_model.layers.45.linear_attn.conv1d",
            "model.language_model.layers.45.linear_attn.in_proj_a",
            "model.language_model.layers.45.linear_attn.in_proj_b",
            "model.language_model.layers.45.mlp.gate",
            "model.language_model.layers.45.mlp.shared_expert_gate",
            "model.language_model.layers.46.linear_attn.conv1d",
            "model.language_model.layers.46.linear_attn.in_proj_a",
            "model.language_model.layers.46.linear_attn.in_proj_b",
            "model.language_model.layers.46.mlp.gate",
            "model.language_model.layers.46.mlp.shared_expert_gate",
            "model.language_model.layers.47.mlp.gate",
            "model.language_model.layers.47.mlp.shared_expert_gate",
            "model.language_model.layers.5.linear_attn.conv1d",
            "model.language_model.layers.5.linear_attn.in_proj_a",
            "model.language_model.layers.5.linear_attn.in_proj_b",
            "model.language_model.layers.5.mlp.gate",
            "model.language_model.layers.5.mlp.shared_expert_gate",
            "model.language_model.layers.6.linear_attn.conv1d",
            "model.language_model.layers.6.linear_attn.in_proj_a",
            "model.language_model.layers.6.linear_attn.in_proj_b",
            "model.language_model.layers.6.mlp.gate",
            "model.language_model.layers.6.mlp.shared_expert_gate",
            "model.language_model.layers.7.mlp.gate",
            "model.language_model.layers.7.mlp.shared_expert_gate",
            "model.language_model.layers.8.linear_attn.conv1d",
            "model.language_model.layers.8.linear_attn.in_proj_a",
            "model.language_model.layers.8.linear_attn.in_proj_b",
            "model.language_model.layers.8.mlp.gate",
            "model.language_model.layers.8.mlp.shared_expert_gate",
            "model.language_model.layers.9.linear_attn.conv1d",
            "model.language_model.layers.9.linear_attn.in_proj_a",
            "model.language_model.layers.9.linear_attn.in_proj_b",
            "model.language_model.layers.9.mlp.gate",
            "model.language_model.layers.9.mlp.shared_expert_gate",
            "model.visual.blocks.0.attn.proj",
            "model.visual.blocks.0.attn.qkv",
            "model.visual.blocks.0.mlp.linear_fc1",
            "model.visual.blocks.0.mlp.linear_fc2",
            "model.visual.blocks.1.attn.proj",
            "model.visual.blocks.1.attn.qkv",
            "model.visual.blocks.1.mlp.linear_fc1",
            "model.visual.blocks.1.mlp.linear_fc2",
            "model.visual.blocks.10.attn.proj",
            "model.visual.blocks.10.attn.qkv",
            "model.visual.blocks.10.mlp.linear_fc1",
            "model.visual.blocks.10.mlp.linear_fc2",
            "model.visual.blocks.11.attn.proj",
            "model.visual.blocks.11.attn.qkv",
            "model.visual.blocks.11.mlp.linear_fc1",
            "model.visual.blocks.11.mlp.linear_fc2",
            "model.visual.blocks.12.attn.proj",
            "model.visual.blocks.12.attn.qkv",
            "model.visual.blocks.12.mlp.linear_fc1",
            "model.visual.blocks.12.mlp.linear_fc2",
            "model.visual.blocks.13.attn.proj",
            "model.visual.blocks.13.attn.qkv",
            "model.visual.blocks.13.mlp.linear_fc1",
            "model.visual.blocks.13.mlp.linear_fc2",
            "model.visual.blocks.14.attn.proj",
            "model.visual.blocks.14.attn.qkv",
            "model.visual.blocks.14.mlp.linear_fc1",
            "model.visual.blocks.14.mlp.linear_fc2",
            "model.visual.blocks.15.attn.proj",
            "model.visual.blocks.15.attn.qkv",
            "model.visual.blocks.15.mlp.linear_fc1",
            "model.visual.blocks.15.mlp.linear_fc2",
            "model.visual.blocks.16.attn.proj",
            "model.visual.blocks.16.attn.qkv",
            "model.visual.blocks.16.mlp.linear_fc1",
            "model.visual.blocks.16.mlp.linear_fc2",
            "model.visual.blocks.17.attn.proj",
            "model.visual.blocks.17.attn.qkv",
            "model.visual.blocks.17.mlp.linear_fc1",
            "model.visual.blocks.17.mlp.linear_fc2",
            "model.visual.blocks.18.attn.proj",
            "model.visual.blocks.18.attn.qkv",
            "model.visual.blocks.18.mlp.linear_fc1",
            "model.visual.blocks.18.mlp.linear_fc2",
            "model.visual.blocks.19.attn.proj",
            "model.visual.blocks.19.attn.qkv",
            "model.visual.blocks.19.mlp.linear_fc1",
            "model.visual.blocks.19.mlp.linear_fc2",
            "model.visual.blocks.2.attn.proj",
            "model.visual.blocks.2.attn.qkv",
            "model.visual.blocks.2.mlp.linear_fc1",
            "model.visual.blocks.2.mlp.linear_fc2",
            "model.visual.blocks.20.attn.proj",
            "model.visual.blocks.20.attn.qkv",
            "model.visual.blocks.20.mlp.linear_fc1",
            "model.visual.blocks.20.mlp.linear_fc2",
            "model.visual.blocks.21.attn.proj",
            "model.visual.blocks.21.attn.qkv",
            "model.visual.blocks.21.mlp.linear_fc1",
            "model.visual.blocks.21.mlp.linear_fc2",
            "model.visual.blocks.22.attn.proj",
            "model.visual.blocks.22.attn.qkv",
            "model.visual.blocks.22.mlp.linear_fc1",
            "model.visual.blocks.22.mlp.linear_fc2",
            "model.visual.blocks.23.attn.proj",
            "model.visual.blocks.23.attn.qkv",
            "model.visual.blocks.23.mlp.linear_fc1",
            "model.visual.blocks.23.mlp.linear_fc2",
            "model.visual.blocks.24.attn.proj",
            "model.visual.blocks.24.attn.qkv",
            "model.visual.blocks.24.mlp.linear_fc1",
            "model.visual.blocks.24.mlp.linear_fc2",
            "model.visual.blocks.25.attn.proj",
            "model.visual.blocks.25.attn.qkv",
            "model.visual.blocks.25.mlp.linear_fc1",
            "model.visual.blocks.25.mlp.linear_fc2",
            "model.visual.blocks.26.attn.proj",
            "model.visual.blocks.26.attn.qkv",
            "model.visual.blocks.26.mlp.linear_fc1",
            "model.visual.blocks.26.mlp.linear_fc2",
            "model.visual.blocks.3.attn.proj",
            "model.visual.blocks.3.attn.qkv",
            "model.visual.blocks.3.mlp.linear_fc1",
            "model.visual.blocks.3.mlp.linear_fc2",
            "model.visual.blocks.4.attn.proj",
            "model.visual.blocks.4.attn.qkv",
            "model.visual.blocks.4.mlp.linear_fc1",
            "model.visual.blocks.4.mlp.linear_fc2",
            "model.visual.blocks.5.attn.proj",
            "model.visual.blocks.5.attn.qkv",
            "model.visual.blocks.5.mlp.linear_fc1",
            "model.visual.blocks.5.mlp.linear_fc2",
            "model.visual.blocks.6.attn.proj",
            "model.visual.blocks.6.attn.qkv",
            "model.visual.blocks.6.mlp.linear_fc1",
            "model.visual.blocks.6.mlp.linear_fc2",
            "model.visual.blocks.7.attn.proj",
            "model.visual.blocks.7.attn.qkv",
            "model.visual.blocks.7.mlp.linear_fc1",
            "model.visual.blocks.7.mlp.linear_fc2",
            "model.visual.blocks.8.attn.proj",
            "model.visual.blocks.8.attn.qkv",
            "model.visual.blocks.8.mlp.linear_fc1",
            "model.visual.blocks.8.mlp.linear_fc2",
            "model.visual.blocks.9.attn.proj",
            "model.visual.blocks.9.attn.qkv",
            "model.visual.blocks.9.mlp.linear_fc1",
            "model.visual.blocks.9.mlp.linear_fc2",
            "model.visual.merger.linear_fc1",
            "model.visual.merger.linear_fc2",
            "model.visual.patch_embed.proj",
            "model.visual.pos_embed",
            "mtp.fc",
            "mtp.layers.0.mlp.gate",
            "mtp.layers.0.mlp.shared_expert_gate"
        ]
    }
}