{
  "architectures": [
    "PanguV2MoEForCausalLM"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 148899,
  "dsa_layers": [0, 3, 6, 9, 12, 15, 18, 21, 24, 27, 30, 33, 36, 39, 42, 45, 48, 49],
  "eos_token_id": 148900,
  "first_k_dense_replace": 3,
  "hidden_act": "silu",
  "hidden_size": 5120,
  "index_head_dim": 128,
  "index_n_heads": 32,
  "index_topk": 2048,
  "intermediate_size": 16128,
  "max_position_embeddings": 524288, 
  "kv_lora_rank": 512,
  "model_type": "pangu_v2_moe",
  "moe_intermediate_size": 1792,
  "n_routed_experts": 384,
  "n_shared_experts": 1,
  "norm_topk_prob": true,
  "num_attention_heads": 64,
  "num_experts_per_tok": 8,
  "num_hidden_layers": 50,
  "num_nextn_predict_layers": 3,
  "param_sink_number": 128,
  "param_sink_with_value": true,
  "q_lora_rank": 1536,
  "qk_nope_head_dim": 128,
  "qk_rope_head_dim": 64,
  "rms_norm_eps": 1e-05,
  "rope_theta": 6400000,
  "rope_interleaved": false,
  "routed_scaling_factor": 2.5,
  "router_enable_expert_bias": true,
  "sandwich_norm": true,
  "sliding_window_list": [512, 512, 512, 512, 512, 512, 512, 512, 512, 512, 512, 512, 512, 512, 512, 512, 512, 512, 512, 512, 512, 512, 512, 512, 512, 512, 512, 512, 512, 512, 512, 512, 2048, 2048, 2048],
  "swa_layers":[1,2,4,5,7,8,10,11,13,14,16,17,19,20,22,23,25,26,28,29,31,32,34,35,37,38,40,41,43,44,46,47,50,51,52],
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.48.2",
  "use_cache": true,
  "v_head_dim": 128,
  "vocab_size": 151552, 
  "use_mhc": true,
  "mhc_use_gamma": true,
  "mhc_recur_norm": 20,
  "mhc_num_stream": 4,
  "use_mome": true,
  "router_sliding_window": 3,
  "block_post_layernorm_idx": [0,4,9,14,19,24,29,34,39,44]
}