{
  "architectures": [
    "PanguUltraMoEForCausalLM"
  ],
  "attention_bias": false,
  "auto_map": {
    "AutoConfig": "configuration_openpangu_moe.PanguUltraMoEConfig",
    "AutoModel": "modeling_openpangu_moe.PanguUltraMoEModel",
    "AutoModelForCausalLM": "modeling_openpangu_moe.PanguUltraMoEForCausalLM"
  },
  "first_k_dense_replace": 3,
  "hidden_act": "silu",
  "hidden_size": 7680,
  "initializer_range": 0.02,
  "intermediate_size": 18432,
  "kv_lora_rank": 512,
  "max_position_embeddings": 131072, 
  "model_type": "pangu_ultra_moe",
  "moe_intermediate_size": 2048,
  "n_routed_experts": 256,
  "n_shared_experts": 1,
  "norm_topk_prob": true,
  "num_attention_heads": 128,
  "num_experts_per_tok": 8,
  "num_hidden_layers": 61,
  "num_key_value_heads": 128,
  "num_nextn_predict_layers": 1,
  "q_lora_rank": 1536,
  "qk_nope_head_dim": 128,
  "qk_rope_head_dim": 64,
  "rms_norm_eps": 1e-05,
  "rope_theta": 25600000,
  "routed_scaling_factor": 2.5,
  "sandwich_norm": true,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.48.2",
  "use_cache": true,
  "v_head_dim": 128,
  "vocab_size": 153600
}