{
  "architectures": ["DeepseekV2ForCausalLM"],
  "model_type": "deepseek_v2",
  "vocab_size": 102400,
  "hidden_size": 5120,
  "intermediate_size": 12288,
  "moe_intermediate_size": 1536,
  "num_hidden_layers": 60,
  "num_attention_heads": 128,
  "num_key_value_heads": 128,
  "head_dim": 128,
  "n_routed_experts": 160,
  "n_shared_experts": 2,
  "num_experts_per_tok": 6,
  "first_k_dense_replace": 1,
  "moe_layer_freq": 1,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16"
}
